
Initializing...
lc_shell> read_lib SUMA180_384X32X1BM1_BC.lib
Reading '/home/wei/VSD_mask_proj/clipQ_hw/mem/bias_32b_sram_1/SUMA180_384X32X1BM1_BC.lib' ...
Warning: Line 45, The default_operating_conditions is not defined. operating_conditions 'BCCOM' is set
        as the default_operating_conditions. (LBDB-663)
Warning: Line 45, The 'internal_power_calculation' attribute in char_config group is required for NLPM library. 
        No default can be applied to this attribute. (LBDB-366)
Technology library 'SUMA180_384X32X1BM1_BC' read successfully
1
lc_shell> write SUMA180_384X32X1BM1_BC -format db -output SUMA180_384X32X1BM1_BC.db
Error: ambiguous command 'write' matched 18 commands:
        (write_app_options, write_app_var, write_clf_antenna_properties ...) (CMD-006)
lc_shell> write_lib SUMA180_384X32X1BM1_BC -format db -output SUMA180_384X32X1BM1_BC.db
Wrote the 'SUMA180_384X32X1BM1_BC' library to '/home/wei/VSD_mask_proj/clipQ_hw/mem/bias_32b_sram_1/SUMA180_384X32X1BM1_BC.db' successfully
1
lc_shell> read_lib SUMA180_384X32X1BM1_TC.lib
Reading '/home/wei/VSD_mask_proj/clipQ_hw/mem/bias_32b_sram_1/SUMA180_384X32X1BM1_TC.lib' ...
Warning: Line 45, The default_operating_conditions is not defined. operating_conditions 'TCCOM' is set
        as the default_operating_conditions. (LBDB-663)
Warning: Line 45, The 'internal_power_calculation' attribute in char_config group is required for NLPM library. 
        No default can be applied to this attribute. (LBDB-366)
Technology library 'SUMA180_384X32X1BM1_TC' read successfully
1
lc_shell> write_lib SUMA180_384X32X1BM1_TC -format db -output SUMA180_384X32X1BM1_TC.db
Wrote the 'SUMA180_384X32X1BM1_TC' library to '/home/wei/VSD_mask_proj/clipQ_hw/mem/bias_32b_sram_1/SUMA180_384X32X1BM1_TC.db' successfully
1
lc_shell> read_lib SUMA180_384X32X1BM1_WC.lib
Reading '/home/wei/VSD_mask_proj/clipQ_hw/mem/bias_32b_sram_1/SUMA180_384X32X1BM1_WC.lib' ...
Warning: Line 45, The default_operating_conditions is not defined. operating_conditions 'WCCOM' is set
        as the default_operating_conditions. (LBDB-663)
Warning: Line 45, The 'internal_power_calculation' attribute in char_config group is required for NLPM library. 
        No default can be applied to this attribute. (LBDB-366)
Technology library 'SUMA180_384X32X1BM1_WC' read successfully
1
lc_shell> write_lib SUMA180_384X32X1BM1_WC -format db -output SUMA180_384X32X1BM1_WC.db
Wrote the 'SUMA180_384X32X1BM1_WC' library to '/home/wei/VSD_mask_proj/clipQ_hw/mem/bias_32b_sram_1/SUMA180_384X32X1BM1_WC.db' successfully
1
lc_shell> exit
Maximum memory usage for this session: 79.09 MB
Maximum memory usage for this session including child processes: 79.09 MB
CPU usage for this session:      1 seconds (  0.00 hours)
Elapsed time for this session:     92 seconds (  0.03 hours)
Thank you for using Library Compiler.

